In [1]:
import pandas as pd

In [9]:
names = ['Nike','Adidas','New Balance','Puma','Reebok']
prices = [176,59,47,38,99]
PriceList = zip(names, prices)
df = pd.DataFrame(data = PriceList, columns = ['Names', 'Prices'])
df.head()

         Names  Prices
0         Nike     176
1       Adidas      59
2  New Balance      47
3         Puma      38
4       Reebok      99

In [13]:
df.loc[df['Prices']<=100]

         Names  Prices
1       Adidas      59
2  New Balance      47
3         Puma      38
4       Reebok      99

In [16]:
import pandas as pd
import numpy as np
names = ['Bob','Jessica','Mary','John','Mel']
grades = [76,-2,77,78,101]

In [19]:
GradeList = zip(names, grades)
df = pd.DataFrame(data = GradeList, columns = ['Names', 'Grades'])
df.head()

     Names  Grades
0      Bob      76
1  Jessica      -2
2     Mary      77
3     John      78
4      Mel     101

In [20]:
df.loc[df['Grades']<= 100]

     Names  Grades
0      Bob      76
1  Jessica      -2
2     Mary      77
3     John      78

In [22]:
df.loc[(df['Grades']<= 100, 'Grades')] = 100
df.head()

     Names  Grades
0      Bob     100
1  Jessica     100
2     Mary     100
3     John     100
4      Mel     101

In [23]:
import pandas as pd
import numpy as np
names = ['Jan','John','Bob','Jan','Mary','Jon','Mel','Mel']
grades = [95,78,76,95,77,78,99,100]

In [26]:
GradeList = zip(names, grades)
df = pd.DataFrame(data = GradeList, columns = ['Names', 'Grades'])
df.head()

  Names  Grades
0   Jan      95
1  John      78
2   Bob      76
3   Jan      95
4  Mary      77

In [30]:
df.duplicated()

0    False
1    False
2    False
3     True
4    False
5    False
6    False
7    False
dtype: bool

In [31]:
df.drop_duplicates()

  Names  Grades
0   Jan      95
1  John      78
2   Bob      76
4  Mary      77
5   Jon      78
6   Mel      99
7   Mel     100